markdownOutput/work_notes/20250903080950-2509_lmoc_gtri.md

# Table of Contents

1.  [GTRI LMOC Schedule](#orgb49ec4d)
    1.  [LMOC 101](#org6694590)
        1.  [Line Up](#orgfe39800)
        2.  [LMOC Console](#org1b2513c)
        3.  [CTDs](#org39c0cd8)
        4.  [CRTO/@Sam](#orge70521e)
    2.  [LMOC v1.7](#org2863f80)
    3.  [RAPID Req](#org0614a55)
    4.  [DB Discussion](#org9022f91)
        1.  [Current Approach](#orgc01ee0d)
        2.  [Comprehensive](#org7ab21e8)
        3.  [Multi Use Codes](#org0367509)
        4.  [Read/Write](#orge08be11)
2.  [LMOC 101](#org6527278)
    1.  [TENA](#orgd843351)
        1.  [Way for other applciations can be used to get data](#orgf85720e)
        2.  [Has a cross-domain solution](#org60f8273)
        3.  [Common Operating Picture (COP)](#org610c3a5)
        4.  [service based](#org898d509)
        5.  [TSPI providers](#org3c8f4bd)
        6.  [FUZE track, can provide the best source to that track](#orgc6b6d61)
        7.  [PRISM : Multi level security solution](#org3a0ee78)
        8.  [LUCI : Line Up Information Card](#org57e59ed)
        9.  [RITA : Real Time Analysis &rsquo;Shot Sheet&rsquo;](#org398df62)
        10. [BLAST : Used to get data form DIS](#org3ab899e)
        11. [DOTT : Data Object Transformation Tool](#org30d2507)
    2.  [LMOC VMs](#orge33bcaf)
        1.  [Went over the VMs lightly. Each VM is like a service?](#orgeb74c84)
    3.  [: When they are flying events, how does it know when events are? do you need to start/stop it?](#orgd91ef5b)
3.  [LMOC v1.7](#orgad69644)
    1.  [RTO functions will be containerized within one event/mission](#org32e5093)
    2.  [TSPI data is nasty sometimes](#orge338e0b)
4.  [RAPID Req](#org60ffde2)
    1.  [PRISM status with our Markers](#orga9f686c)
        1.  [How/what is needed for us to push Markers to their DB with PRISM in mind.](#org0342ed2)
    2.  [One thing that was coming up was the fact on what are we going to share.](#orga9ad922)
        1.  [This comes into if we are placing into their DB or if they are grabbing things from us.](#org0f5afab)
        2.  [This is a bigger quesiton with Bob and I don&rsquo;t believe we will be giving, but they can get it via sharing.](#orgb73a9e7)
        3.  [: If we are sharing what is to stop them from just grabbing it. We want to play and integrate but what is too much](#orga3f0667)
5.  [DB Structure talking](#orgfc62c91)
    1.  [Talks about TENA, and making DB efficient?](#orgdb66cd0)
        1.  [Unsure what is truly being talked about.](#org60d7bbf)
        2.  [Are they talking about the DB efficiency of a DB read/write or what](#org8b21c6d)
        3.  [They are talking about TENA storing everything, and also how to integrate the data that is **not** TENA data objects?](#orgd0f2570)
        4.  [SQL is being talked about and stuff](#orged5e510)
        5.  [POSTGRES with JSON streamer](#org763a09c)
        6.  [Using MetaData to speed up the querying](#orgde6a520)
        7.  [Time to Create to create the briefing db](#org4df1ad3)
        8.  [looking for a commitment to aid with the DB](#org3ed41b2)
        9.  [Recording Live data, messy then clean it up afterwards for getting data](#org94c4221)
        10. [They are talking about other things such as how to make it quick and the correct data?](#org2901f6c)
6.  [Talking about DB Structures](#orgd0f9e31)
    1.  [They are talking about pushing RAPID stuff](#org0cbcece)
        1.  [I do not think we are pushing to the DB ever?](#orgdc89843)
    2.  [Taking data via DOTT or something else?](#orgff7e359)
    3.  [: What is TIDE and Flyout Source](#org50b2589)
    4.  [TIDE : Being used as a service broker? Still unsure what this is actually doing](#orgd450de1)
        1.  [TIDE handling the piecemill](#org84e5ff9)
    5.  [TIDE handling the verisoning and tagging](#org7c381a0)
    6.  [ARCADB is mainly used for PRISM and a multi-level security system](#orgda6132e)
        1.  [This is mainly used at a high lievel to access data, and the context allows the users to be unaware of the other data that is within there](#orgfc1fa55)
        2.  [Likely what I was thinking about, but it is going to be context on the security rather than the type of data](#org4be345a)
7.  [ARCADB / TIDE/ Talking](#orga835741)
    1.  [TIDE](#org5072205)
        1.  [Will be a data broker to the ARCADB](#orga5697d4)
        2.  [PRISM 1.5 for LMOC 1.7](#orgf6fb498)



<a id="orgb49ec4d"></a>

# GTRI LMOC Schedule


<a id="org6694590"></a>

## LMOC 101


<a id="orgfe39800"></a>

### Line Up


<a id="org1b2513c"></a>

### LMOC Console


<a id="org39c0cd8"></a>

### CTDs


<a id="orge70521e"></a>

### CRTO/@Sam


<a id="org2863f80"></a>

## LMOC v1.7


<a id="org0614a55"></a>

## RAPID Req


<a id="org9022f91"></a>

## DB Discussion


<a id="orgc01ee0d"></a>

### Current Approach


<a id="org7ab21e8"></a>

### Comprehensive


<a id="org0367509"></a>

### Multi Use Codes


<a id="orge08be11"></a>

### Read/Write


<a id="org6527278"></a>

# LMOC 101


<a id="orgd843351"></a>

## TENA


<a id="orgf85720e"></a>

### Way for other applciations can be used to get data


<a id="org60f8273"></a>

### Has a cross-domain solution


<a id="org610c3a5"></a>

### Common Operating Picture (COP)


<a id="org898d509"></a>

### service based


<a id="org3c8f4bd"></a>

### TSPI providers

1.  Can also take radar to make tspi


<a id="orgc6b6d61"></a>

### FUZE track, can provide the best source to that track

1.  QUESTION : what is considered best source


<a id="org3a0ee78"></a>

### PRISM : Multi level security solution


<a id="org57e59ed"></a>

### LUCI : Line Up Information Card


<a id="org398df62"></a>

### RITA : Real Time Analysis &rsquo;Shot Sheet&rsquo;


<a id="org3ab899e"></a>

### BLAST : Used to get data form DIS


<a id="org30d2507"></a>

### DOTT : Data Object Transformation Tool


<a id="orge33bcaf"></a>

## LMOC VMs


<a id="orgeb74c84"></a>

### Went over the VMs lightly. Each VM is like a service?


<a id="orgd91ef5b"></a>

## QUESTION : When they are flying events, how does it know when events are? do you need to start/stop it?


<a id="orgad69644"></a>

# LMOC v1.7


<a id="org32e5093"></a>

## RTO functions will be containerized within one event/mission


<a id="orge338e0b"></a>

## TSPI data is nasty sometimes


<a id="org60ffde2"></a>

# RAPID Req


<a id="orga9f686c"></a>

## PRISM status with our Markers


<a id="org0342ed2"></a>

### How/what is needed for us to push Markers to their DB with PRISM in mind.

1.  QUESTION : What is needed or the PRISM aware marker?


<a id="orga9ad922"></a>

## One thing that was coming up was the fact on what are we going to share.


<a id="org0f5afab"></a>

### This comes into if we are placing into their DB or if they are grabbing things from us.


<a id="orgb73a9e7"></a>

### This is a bigger quesiton with Bob and I don&rsquo;t believe we will be giving, but they can get it via sharing.


<a id="orga3f0667"></a>

### QUESTION : If we are sharing what is to stop them from just grabbing it. We want to play and integrate but what is too much


<a id="orgfc62c91"></a>

# DB Structure talking


<a id="orgdb66cd0"></a>

## Talks about TENA, and making DB efficient?


<a id="org60d7bbf"></a>

### Unsure what is truly being talked about.


<a id="org8b21c6d"></a>

### Are they talking about the DB efficiency of a DB read/write or what


<a id="orgd0f2570"></a>

### They are talking about TENA storing everything, and also how to integrate the data that is **not** TENA data objects?


<a id="orged5e510"></a>

### SQL is being talked about and stuff


<a id="org763a09c"></a>

### POSTGRES with JSON streamer


<a id="orgde6a520"></a>

### Using MetaData to speed up the querying


<a id="org4df1ad3"></a>

### Time to Create to create the briefing db


<a id="org3ed41b2"></a>

### looking for a commitment to aid with the DB


<a id="org94c4221"></a>

### Recording Live data, messy then clean it up afterwards for getting data


<a id="org2901f6c"></a>

### They are talking about other things such as how to make it quick and the correct data?


<a id="orgd0f9e31"></a>

# Talking about DB Structures


<a id="org0cbcece"></a>

## They are talking about pushing RAPID stuff


<a id="orgdc89843"></a>

### I do not think we are pushing to the DB ever?


<a id="orgff7e359"></a>

## Taking data via DOTT or something else?


<a id="org50b2589"></a>

## QUESTION : What is TIDE and Flyout Source


<a id="orgd450de1"></a>

## TIDE : Being used as a service broker? Still unsure what this is actually doing


<a id="org84e5ff9"></a>

### TIDE handling the piecemill


<a id="org7c381a0"></a>

## TIDE handling the verisoning and tagging


<a id="orgda6132e"></a>

## ARCADB is mainly used for PRISM and a multi-level security system


<a id="orgfc1fa55"></a>

### This is mainly used at a high lievel to access data, and the context allows the users to be unaware of the other data that is within there


<a id="org4be345a"></a>

### Likely what I was thinking about, but it is going to be context on the security rather than the type of data


<a id="orga835741"></a>

# ARCADB / TIDE/ Talking


<a id="org5072205"></a>

## TIDE


<a id="orga5697d4"></a>

### Will be a data broker to the ARCADB


<a id="orgf6fb498"></a>

### PRISM 1.5 for LMOC 1.7

**\***

